In [1]:
import pandas as pd

In [7]:
d = {"foo": ["one", "two", "one", "two", "one", "two"], "bar": ["A","B","C","A","B","C"], "baz" : [1,2,3,4,5,6]}
df = pd.DataFrame(data = d)
df

   foo bar  baz
0  one   A    1
1  two   B    2
2  one   C    3
3  two   A    4
4  one   B    5
5  two   C    6

In [8]:
# Pivotieren = Alternative zu gruppieren
df.pivot(index = "foo", columns = "bar", values = "baz")
# Es wird nach foo Spalte gruppiert fuer die jeweiligen Spalte bar. Der Wert bleibt der von baz.

bar  A  B  C
foo
one  1  5  3
two  4  2  6

In [12]:
df.melt(value_vars="bar")

  variable value
0      bar     A
1      bar     B
2      bar     C
3      bar     A
4      bar     B
5      bar     C